Тест/Тест/src/Documents/ПоступлениеТМЦВорктрак/ПоступлениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТМЦВорктрак</name>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>DocumentRef.Расходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениенаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/ДвижениеТМЦВорктрак/ДвижениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеТМЦВорктрак</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ПеремещениеТМЦВорктрак/ПеремещениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТМЦВорктрак</name>
  <basedOn>Document.ПоступлениеТМЦВорктрак</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСписания</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/СписаниеТМЦВорктрак/СписаниеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТМЦВорктрак</name>
  <basedOn>Document.ПоступлениеТМЦВорктрак</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>EnumRef.ВидыСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВРасход</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВПродажу</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВЗаказНаряд</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНаСотрудника</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНаОтдел</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСписания</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВРасход</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ИнвентарныеНомера/ИнвентарныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвентарныеНомера</name>
  <owners>Catalog.СкладСнабжение</owners>
  <owners>Catalog.ТМЦВорктрак</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПоступлениеТМЦ</types>
      <types>DocumentRef.ПоступлениеТМЦСкладСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвентарногоНомераТМЦ</name>
    <type>
      <types>EnumRef.СтатусыИнвентарныхНомеровТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Documents/ПоступлениеТМЦВорктрак/ObjectModule.bsl
#Область ОбработчикиСобытийФормы

Процедура ОбработкаПроведения(Отказ, Режим)
	
	///+ГомзМА 07.04.2023
	// регистр ДвижениеТМЦВорктрак Приход
	Движения.ДвижениеТМЦВорктрак.Записывать = Истина;
	
	Для каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИнвентарныеНомера.Владелец КАК ТМЦ,
			|	ИнвентарныеНомера.Наименование КАК Наименование,
			|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер,
			|	ИнвентарныеНомера.ДатаПоступления КАК ДатаПоступления,
			|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
			|	ИнвентарныеНомера.Ссылка КАК Ссылка,
			|	ИнвентарныеНомера.Стоимость КАК Цена
			|ИЗ
			|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
			|ГДЕ
			|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
			|	И ИнвентарныеНомера.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
			Запрос.УстановитьПараметр("Владелец", 			 ТекСтрокаСписокТМЦ.ТМЦ);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ТекСтрокаСписокТМЦ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
				Пока РезультатЗапроса.Следующий() Цикл
					Движение 					= Движения.ДвижениеТМЦВорктрак.Добавить();
					Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					Движение.Период 			= Дата;
					Движение.ТМЦ 				= РезультатЗапроса.ТМЦ;
					Движение.МестоХранения 		= ТекСтрокаСписокТМЦ.Склад;
					Движение.ИнвентарныйНомер 	= РезультатЗапроса.Ссылка;
					Движение.Количество 		= 1;
					Движение.Цена 				= РезультатЗапроса.Цена;
				КонецЦикла;
			Иначе
				Пока РезультатЗапроса.Следующий() Цикл
					Движение 					= Движения.ДвижениеТМЦВорктрак.Добавить();
					Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					Движение.Период 			= Дата;
					Движение.ТМЦ 				= РезультатЗапроса.ТМЦ;
					Движение.МестоХранения 		= ТекСтрокаСписокТМЦ.Склад;
					Движение.ИнвентарныйНомер 	= РезультатЗапроса.Ссылка;
					Движение.Количество 		= ТекСтрокаСписокТМЦ.Количество;
					Движение.Цена 				= РезультатЗапроса.Цена;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	///-ГомзМА 07.04.2023

КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный 	= ПользователиИнформационнойБазы.ТекущийПользователь();
	Склад 			= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	Организация 	= Справочники.Организация.НайтиПоКоду	  ("000000005");
	
		///+ГомзМА 27.04.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		Ответственный 	= Ответственный;
		Поставщик 		= ДанныеЗаполнения.Получатель;
		ЗаявкаНаРасход 	= ДанныеЗаполнения.Ссылка;
		/// Комлев 19/06/24 +++
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.ТМЦ Цикл
			НоваяСтрока 				= СписокТМЦ.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Код = ТекСтрокаТовары.НоменклатураТМЦ.Код;
			НоваяСтрока.ТМЦ = ТекСтрокаТовары.НоменклатураТМЦ;
			
			НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			НоваяСтрока.ТМЦПоНакладной 	= ТекСтрокаТовары.НаименованиеПоНакладной;
			НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
			НоваяСтрока.ТипУчета 		= Перечисления.ТипУчетаТМЦ.УчестьКомплектом;
			НоваяСтрока.Склад = Склад;
		КонецЦикла;
		/// Комлев 19/06/24 ---
	КонецЕсли;
	///-ГомзМА 27.04.2023
		
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	///+ГомзМА 14.04.2023
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат
	КонецЕсли;
	///-ГомзМА 14.04.2023
	
	///+ГомзМА 25.04.2023
	Если Проведен Тогда
		Для каждого СтрокаСписокТМЦ Из СписокТМЦ Цикл
			ЗаполнитьИнвентарныеНомераНаСервере(Отказ, СтрокаСписокТМЦ);
		КонецЦикла;
		///-ГомзМА 25.04.2023
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления";
		
		Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Пока РезультатЗапроса.Следующий() Цикл
				ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
				
				ТоварСписанИлиПеремещен = ТоварЕстьВСписанииИлиПеремещении(РезультатЗапроса.Ссылка);
				
				Если ТоварСписанИлиПеремещен = 0 Тогда
					УстановитьПривилегированныйРежим(Истина);
					ДокОбъект.Удалить();
				Иначе
					Отказ = Истина;
					Сообщить("Невозможно отменить проведение документа, так как товар используется в списании или перемещении!");
					Возврат;
				КонецЕсли;
				
				
			КонецЦикла;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнвентарныеНомераНаСервере(Отказ = Ложь, СтрокаСписокТМЦ)
	
	///+ГомзМА 14.04.2023
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ДокументПоступления", Ссылка);
	ДанныеЗаполнения.Вставить("ДатаПоступления", 	 Дата);
	
	КоличествоИнвНомеровПоТМЦ = ПолучитьКоличествоИнвентарныхНомеровПоТМЦ(СтрокаСписокТМЦ);
	
	//Для каждого СтрокаТаблицы Из СписокТМЦ Цикл
	Если КоличествоИнвНомеровПоТМЦ.Количество() = 0 Тогда
		Если СтрокаСписокТМЦ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
			Для Сч = 1 По СтрокаСписокТМЦ.Количество Цикл
				ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
				ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
				ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
				НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ);
			КонецЦикла;
		Иначе
			ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
			ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
			ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
			НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ);
		КонецЕсли;
	КонецЕсли;
		
		Для каждого СтрокаИнвНомеров Из КоличествоИнвНомеровПоТМЦ Цикл
			Если СтрокаСписокТМЦ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно И
				 СтрокаСписокТМЦ.ТМЦ 		= СтрокаИнвНомеров.Владелец И 
				 Ссылка 					= СтрокаИнвНомеров.ДокументПоступления И 
				 СтрокаСписокТМЦ.Количество > СтрокаИнвНомеров.Количество Тогда

					Для Сч = 1 По СтрокаСписокТМЦ.Количество - СтрокаИнвНомеров.Количество Цикл
						ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
						ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
						ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
						НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ); 
					КонецЦикла;
					
				ИначеЕсли СтрокаСписокТМЦ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно И
						  СтрокаСписокТМЦ.ТМЦ 		= СтрокаИнвНомеров.Владелец И
						  Ссылка 					= СтрокаИнвНомеров.ДокументПоступления И
						  СтрокаСписокТМЦ.Количество < СтрокаИнвНомеров.Количество Тогда
					
							ДанныеЗаполнения.Вставить("ТМЦ", СтрокаСписокТМЦ.ТМЦ);
							УдалитьЛишниеИнвентарныеНомера(ДанныеЗаполнения, Отказ, СтрокаИнвНомеров.Количество - СтрокаСписокТМЦ.Количество);
				КонецЕсли;
			КонецЦикла;
			
			//КонецЦикла;
			///-ГомзМА 14.04.2023	

КонецПроцедуры

&НаСервере
Процедура УдалитьЛишниеИнвентарныеНомера(ДанныеЗаполнения, Отказ, Количество)
	
	///+ГомзМА 20.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Код КАК Код,
		|	ИнвентарныеНомера.Ссылка КАК Ссылка,
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
		|	И ИнвентарныеНомера.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
	Запрос.УстановитьПараметр("Владелец", ДанныеЗаполнения.ТМЦ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Сч = 0 По Количество - 1 Цикл
		//Удаление наименования по накладной из регистра сведений
		Запись 					= РегистрыСведений.НаименованиеТМЦПоНакладной.СоздатьМенеджерЗаписи();
		Запись.ТМЦ 				= РезультатЗапроса[Сч].Владелец;
		Запись.ИнвентарныйНомер = РезультатЗапроса[Сч].Ссылка;
		Запись.Удалить();
		
		//Удаление инвентарного номера
		СправочникОбъект = РезультатЗапроса[Сч].Ссылка.ПолучитьОбъект();
		СправочникОбъект.Удалить();

	КонецЦикла;
	///-ГомзМА 20.04.2023

КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоИнвентарныхНомеровПоТМЦ(СтрокаСписокТМЦ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
		|	И ИнвентарныеНомера.Владелец = &Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвентарныеНомера.Владелец,
		|	ИнвентарныеНомера.ДокументПоступления";
	
	Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
	Запрос.УстановитьПараметр("Владелец", 			 СтрокаСписокТМЦ.ТМЦ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
	
КонецФункции 

Функция ТоварЕстьВСписанииИлиПеремещении(ИнвентарныйНомер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТМЦВорктрак.СписокТМЦ КАК ПеремещениеТМЦВорктракСписокТМЦ
		|ГДЕ
		|	ПеремещениеТМЦВорктракСписокТМЦ.ИнвентарныйНомер = &ИнвентарныйНомер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеТМЦВорктракСписокТМЦ.Ссылка
		|ИЗ
		|	Документ.СписаниеТМЦВорктрак.СписокТМЦ КАК СписаниеТМЦВорктракСписокТМЦ
		|ГДЕ
		|	СписаниеТМЦВорктракСписокТМЦ.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Количество();


КонецФункции // ()

#КонецОбласти
